Revit 2026 API

# DimensionTypeSetEqualityFormula Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting> formattingArr
)
```
```vb
Public Sub SetEqualityFormula (
	formattingArr As IList(Of DimensionEqualityLabelFormatting)
)
```
```cpp
public:
void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting^>^ formattingArr
)
```
```fsharp
member SetEqualityFormula :
        formattingArr : IList<DimensionEqualityLabelFormatting> -> unit
```

#### Parameters

formattingArr IListDimensionEqualityLabelFormatting

#### Reference

DimensionType Class

Autodesk.Revit.DB Namespace